app/controllers/admin/events_controller.rb

UPDATE "events" SET "admin_no" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["admin_no", 1], ["updated_at", "2018-11-17 12:23:43.800315"], ["id", 1]]
---
  def sayno
    @event = Event.find(params[:id])
    if @event.update(admin_no: true)