app/controllers/admin/events_controller.rb

  def check
    @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def approve
    @event = Event.find(params[:id])
    if params[:sayno] == nil
      @event.update(admin_ok: true, admin_message: params[:event][:admin_message])
    else
      @event.update(admin_no: true, admin_message: params[:event][:admin_message])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "events" SET "admin_ok" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["admin_ok", 1], ["updated_at", "2018-11-17 12:00:18.439107"], ["id", 3]]
UPDATE "events" SET "admin_no" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["admin_no", 1], ["updated_at", "2018-11-17 12:23:43.800315"], ["id", 1]]