app/controllers/admin/past_events_controller.rb

SELECT "past_events".* FROM "past_events"
---
  def index
    @past_events = PastEvent.all

SELECT  "past_events".* FROM "past_events" WHERE "past_events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_past_event
      @past_event = PastEvent.find(params[:id])