app/controllers/admin/regist_users_controller.rb

SELECT  "regist_users".* FROM "regist_users" WHERE "regist_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @regist_user = RegistUser.find(params[:id])

SELECT  "regist_users".* FROM "regist_users" WHERE "regist_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @regist_user = RegistUser.find(params[:id])

SELECT  "regist_users".* FROM "regist_users" ORDER BY "regist_users"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    @regist_users = RegistUser.page(params[:page]).reverse_order

SELECT  "regist_users".* FROM "regist_users" WHERE "regist_users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "regist_users" WHERE "regist_users"."id" = ?  [["id", 2]]
---
  def destroy
    regist_user = RegistUser.find(params[:id])
    regist_user.destroy

SELECT  "regist_users".* FROM "regist_users" WHERE "regist_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "regist_users" SET "job" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "regist_users"."id" = ?  [["job", "専業主ふ"], ["profile_image_id", "788901fdb0c8682a97a4a57586d09cd40c1f468251d7df7f4e7c54cdd2e3"], ["updated_at", "2018-11-17 06:26:33.606018"], ["id", 1]]
---
  def update
    regist_user = RegistUser.find(params[:id])
    if regist_user.update(regist_user_params)