app/controllers/admins_controller.rb

   def show
     @events = Event.where(admin_ok: false, admin_no: false)
---
SELECT "events".* FROM "events" WHERE "events"."admin_ok" = ? AND "events"."admin_no" = ?  [["admin_ok", 0], ["admin_no", 0]]