app/controllers/admins_controller.rb

  def show
    @events = Event.where(admin_ok: false, admin_no: false, finish: false).order(start_time: :desc)
    @eventsOK = Event.where(admin_ok: true, finish: false)
    eventsFinish = Event.order(finish_time: :desc)
    now = Time.now

    @past_events = []

    if eventsFinish != nil
      eventsFinish.each do |eventFinish|
---
SELECT "events".* FROM "events"