app/controllers/desks_controller.rb

SELECT "desks".* FROM "desks"
---
  def index
    @desks = Desk.all

SELECT  "desks".* FROM "desks" WHERE "desks"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_desk
      @desk = Desk.find(params[:id])