app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."year" = ? AND "events"."month" = ?  [["year", 2018], ["month", 11]]
SELECT "events".* FROM "events" WHERE "events"."start_time" BETWEEN ? AND ?  [["start_time", "2018-11-19 00:00:00"], ["start_time", "2018-11-25 23:59:59.999999"]]
---
  def index
    x = Time.now
    a = x.year
    b = x.month
    @events = Event.where(year: a, month: b)

    from = Time.now.at_beginning_of_day
    to = (from + 6.day).at_end_of_day
    @events2 = Event.where(start_time: from..to)

SELECT "events".* FROM "events" WHERE "events"."year" = ? AND "events"."month" = ?  [["year", 2018], ["month", 12]]
SELECT "events".* FROM "events" WHERE "events"."start_time" BETWEEN ? AND ?  [["start_time", "2018-12-01 00:00:00"], ["start_time", "2018-12-07 23:59:59.999999"]]
---
  def next_month
    x = Time.now

    if j == 12
      c = x.year + 1
    else
      c = x.year
    end

    @events = Event.where(year: c, month: x.next_month.month)
    from = x.next_month.at_beginning_of_month
    to = (from + 6.day).at_end_of_day
    @events2 = Event.where(start_time: from..to)