app/controllers/past_events_controller.rb

    def set_past_event
      @past_event = PastEvent.find(params[:id])
---
SELECT  "past_events".* FROM "past_events" WHERE "past_events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]