app/controllers/regist_users_controller.rb

SELECT "regist_users".* FROM "regist_users"
---
  def index
  	@regist_users = RegistUser.all

SELECT  "regist_users".* FROM "regist_users" WHERE "regist_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."regist_user_id" = ? AND "events"."admin_ok" = ?  [["regist_user_id", 1], ["admin_ok", 1]]
---
  def show
  	@regist_user = RegistUser.find(params[:id])
    @admin = Admin.find(1)

    @events = Event.where(regist_user_id: @regist_user.id, admin_ok: false) && Event.where(regist_user_id: @regist_user.id, admin_no: true)