app/controllers/regist_user/desks_controller.rb

  def index
    @desks = Desk.all
---
SELECT "desks".* FROM "desks"