app/controllers/regist_user/events_controller.rb

SELECT COUNT(*) FROM "events"
---
      binding.pry
  #ここまでで予約時間内での比較は終了。

      if Event.count == 0

INSERT INTO "events" ("start_time", "finish_time", "title", "regist_user_id", "content", "created_at", "updated_at", "event_image_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
        end
          @event.start_time = x
          @event.finish_time = y
          @event.save

INSERT INTO "desks" ("created_at", "updated_at", "desk_number", "start", "finish", "event_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2018-11-15 09:02:30.886141"], ["updated_at", "2018-11-15 09:02:30.886141"], ["desk_number", 1], ["start", "2018-12-01 10:00:00"], ["finish", "2018-12-01 11:00:00"], ["event_id", 1]]
INSERT INTO "desk_numbers" ("created_at", "updated_at", "desk_number", "start", "finish", "event_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2018-11-16 12:51:32.844936"], ["updated_at", "2018-11-16 12:51:32.844936"], ["desk_number", 1], ["start", "2018-12-01 11:00:00"], ["finish", "2018-12-01 15:00:00"], ["event_id", 1]]
INSERT INTO "events" ("start_time", "finish_time", "title", "regist_user_id", "content", "created_at", "updated_at", "event_image_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
          @desk_number.finish = y
          @desk_number.event_id  = @event.id
          @desk_number.desk_number = o
          @desk_number.save

SELECT "events".* FROM "events" WHERE "events"."year" = ? AND "events"."month" = ? AND "events"."day" = ?  [["year", 2018], ["month", 12], ["day", 1]]
---

      else

        event_exists = Event.where(year: i, month: a, day: b)

SELECT "desks".* FROM "desks"
SELECT "desk_numbers".* FROM "desk_numbers" WHERE "desk_numbers"."event_id" = ?  [["event_id", 1]]
---
            # まず子テーブルのテーブル番号が重複していないか調べる


            event_exist.desk_numbers.each do |desk_number|

INSERT INTO "events" ("start_time", "finish_time", "title", "regist_user_id", "content", "created_at", "updated_at", "event_image_id", "participant", "desk", "year", "month", "day") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
          end #event_exists.each do |event_exist|のend
            @event.start_time = x
            @event.finish_time = y
            @event.save

INSERT INTO "desks" ("created_at", "updated_at", "desk_number", "start", "finish", "event_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2018-11-15 09:02:30.886141"], ["updated_at", "2018-11-15 09:02:30.886141"], ["desk_number", 1], ["start", "2018-12-01 10:00:00"], ["finish", "2018-12-01 11:00:00"], ["event_id", 1]]
INSERT INTO "desk_numbers" ("created_at", "updated_at", "desk_number", "start", "finish", "event_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2018-11-17 10:31:35.972993"], ["updated_at", "2018-11-17 10:31:35.972993"], ["desk_number", 4], ["start", "2018-11-18 01:00:00"], ["finish", "2018-11-18 02:00:00"], ["event_id", 2]]
---
            @desk_number.finish = y
            @desk_number.event_id  = @event.id
            @desk_number.desk_number = o
            @desk_number.save

INSERT INTO "events" ("start_time", "finish_time", "title", "regist_user_id", "content", "created_at", "updated_at", "event_image_id", "participant", "desk", "year", "month", "day") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
        else #event_exists.exists?で、同じ日付のデータが無い場合
          @event.start_time = x
          @event.finish_time = y
          @event.save

INSERT INTO "desk_numbers" ("created_at", "updated_at", "desk_number", "start", "finish", "event_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2018-11-18 12:20:08.293868"], ["updated_at", "2018-11-18 12:20:08.293868"], ["desk_number", 4], ["start", "2018-12-05 03:00:00"], ["finish", "2018-12-05 07:00:00"], ["event_id", 6]]
---
          @desk_number.finish = y
          @desk_number.event_id  = @event.id
          @desk_number.desk_number = o
          @desk_number.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    binding.pry
    @event = Event.find(params[:id])