app/controllers/regist_user/events_controller.rb

SELECT  "regist_users".* FROM "regist_users" WHERE "regist_users"."id" = ? ORDER BY "regist_users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    if Event.find(params[:id]).regist_user_id != current_regist_user.id

SELECT  "regist_users".* FROM "regist_users" WHERE "regist_users"."id" = ? ORDER BY "regist_users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    if Event.find(params[:id]).regist_user_id != current_regist_user.id

SELECT  1 AS one FROM "events" LIMIT ?  [["LIMIT", 1]]
SELECT "events".* FROM "events"
---
  def create
    @event = Event.new(event_params)

    a = params[:a].to_i
    b = params[:b].to_i
    c = params[:c].to_i
    d = params[:d].to_i
    h = Time.now
    j = h.month

    if params[:a].blank? || params[:b].blank? || params[:c].blank? || params[:d].blank? || @event.title.blank? || @event.content.blank? || @event.participant.blank? || @event.desk.blank?

INSERT INTO "events" ("title", "regist_user_id", "content", "created_at", "updated_at", "event_image_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", ""], ["regist_user_id", 1], ["content", ""], ["created_at", "2018-11-15 06:13:19.624464"], ["updated_at", "2018-11-15 06:13:19.624464"], ["event_image_id", nil]]
---
        if Event.count == 0
          @event.start_time = x
          @event.finish_time = y
          @event.save

INSERT INTO "events" ("start_time", "finish_time", "title", "regist_user_id", "content", "created_at", "updated_at", "event_image_id", "desk") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
            @desk_number.finish = y
            @desk_number.event_id  = @event.id
            @desk_number.desk_number = o
            @desk_number.save

SELECT "desks".* FROM "desks"
---
              # if event_exist.start_time.to_date == x.to_date
              # 同じ日付の時はこちらに流れるのでここから時間の比較演算を行う
              # まず子テーブルのテーブル番号が重複していないか調べる
              event_exist.desk_numbers.each do |desk_number|

SELECT "events".* FROM "events" WHERE (start_time >= '2018-11-16')
---
  def update
    @event = Event.find(params[:id])

SELECT "events".* FROM "events" WHERE "events"."year" = ? AND "events"."month" = ? AND "events"."day" = ?  [["year", 2018], ["month", 11], ["day", 18]]
---

      if x > h && y > x
      #ここまでで予約時間内での比較は終了。
        event_exists = Event.where(year: i, month: a, day: b)