app/controllers/regist_user/past_events_controller.rb

  def index
    @past_events = PastEvent.all
---
SELECT "past_events".* FROM "past_events"