app/controllers/regist_user/past_events_controller.rb

SELECT  "past_events".* FROM "past_events" WHERE "past_events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @past_event = PastEvent.find(params[:id])

SELECT  "past_events".* FROM "past_events" WHERE "past_events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_past_event
      @past_event = PastEvent.find(params[:id])